text = "Навчання — це не просто засвоєння фактів, а процес формування мислення. Кожна людина здатна розвиватися, якщо докладатиме зусиль і матиме правильне середовище для зростання."

# 1. lower() — перетворює весь текст у нижній регістр
text_lower = text.lower()

# 2. count() — рахує кількість входжень слова "процес"
process_count = text_lower.count("процес")

# 3. replace() — замінює слово "мислення" на "думок"
text_replaced = text_lower.replace("мислення", "думок")

print("Оригінал у нижньому регістрі:")
print(text_lower)
print("\nКількість входжень слова 'процес':", process_count)
print("\nТекст після заміни:")
print(text_replaced)
#/////////////////
#Венесено зміни Лисаченком Павлом
#/////////////////
words = text.split()

#isalpha() — перевіряє, чи складається слово лише з літер (фільтруємо без пунктуації)
cWords = [word for word in words if word.isalpha()]

#len() — вбудована функція для підрахунку кількості "чистих" слів
wCount = len(cWords)

print("Кількість слів без пунктуації:", wCount)
